In [1]:
person = {
    "first" : 'Prasit',
    "last" : 'Poudel',
    "email" : 'PrasitPoudel@gmail.com'
}

In [2]:
people = {
    "first" : ['Prasit'],
    "last" : ['Poudel'],
    "email" : ['PrasitPoudel@gmail.com']
}

In [3]:
people = {
    "first" : ['Prasit', 'Ram', 'Krishna'],
    "last" : ['Poudel', 'Kshetri', 'Yadav'],
    "email" : ['PrasitPoudel@gmail.com', 'RamKshetri@outlook.com', 'KrishnaYadav@yahoo.com']
}

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame(people)

In [6]:
df

     first     last                   email
0   Prasit   Poudel  PrasitPoudel@gmail.com
1      Ram  Kshetri  RamKshetri@outlook.com
2  Krishna    Yadav  KrishnaYadav@yahoo.com

In [7]:
df['email']

0    PrasitPoudel@gmail.com
1    RamKshetri@outlook.com
2    KrishnaYadav@yahoo.com
Name: email, dtype: object

In [8]:
people['email']

['PrasitPoudel@gmail.com', 'RamKshetri@outlook.com', 'KrishnaYadav@yahoo.com']

In [9]:
df.email # better no to use this as it may conflict with methods of DataFrames

0    PrasitPoudel@gmail.com
1    RamKshetri@outlook.com
2    KrishnaYadav@yahoo.com
Name: email, dtype: object

In [10]:
df[['last', 'email']]

      last                   email
0   Poudel  PrasitPoudel@gmail.com
1  Kshetri  RamKshetri@outlook.com
2    Yadav  KrishnaYadav@yahoo.com

In [11]:
type(df[['last', 'email']])

pandas.core.frame.DataFrame

In [12]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [13]:
df.iloc[0]

first                    Prasit
last                     Poudel
email    PrasitPoudel@gmail.com
Name: 0, dtype: object

In [14]:
type(df.iloc[0])

pandas.core.series.Series

In [15]:
df.iloc[[0,2]]

     first    last                   email
0   Prasit  Poudel  PrasitPoudel@gmail.com
2  Krishna   Yadav  KrishnaYadav@yahoo.com

In [16]:
df.iloc[[0,2], 2]

0    PrasitPoudel@gmail.com
2    KrishnaYadav@yahoo.com
Name: email, dtype: object

In [17]:
df

     first     last                   email
0   Prasit   Poudel  PrasitPoudel@gmail.com
1      Ram  Kshetri  RamKshetri@outlook.com
2  Krishna    Yadav  KrishnaYadav@yahoo.com

In [18]:
df.loc[[0,1]]

    first     last                   email
0  Prasit   Poudel  PrasitPoudel@gmail.com
1     Ram  Kshetri  RamKshetri@outlook.com

In [19]:
df.loc[[0,1], ['email','last']]

                    email     last
0  PrasitPoudel@gmail.com   Poudel
1  RamKshetri@outlook.com  Kshetri

In [20]:
df.loc[[0,1], ['email','last']].columns

Index(['email', 'last'], dtype='object')

In [21]:
df['email']

0    PrasitPoudel@gmail.com
1    RamKshetri@outlook.com
2    KrishnaYadav@yahoo.com
Name: email, dtype: object

In [22]:
df.set_index('email', inplace=True) # eqv to df = df.set_index('email)

In [23]:
df

                          first     last
email
PrasitPoudel@gmail.com   Prasit   Poudel
RamKshetri@outlook.com      Ram  Kshetri
KrishnaYadav@yahoo.com  Krishna    Yadav

In [24]:
df.index

Index(['PrasitPoudel@gmail.com', 'RamKshetri@outlook.com',
       'KrishnaYadav@yahoo.com'],
      dtype='object', name='email')

In [25]:
df.loc['PrasitPoudel@gmail.com', 'first']

'Prasit'

In [26]:
df.reset_index(inplace=True)

In [27]:
df

                    email    first     last
0  PrasitPoudel@gmail.com   Prasit   Poudel
1  RamKshetri@outlook.com      Ram  Kshetri
2  KrishnaYadav@yahoo.com  Krishna    Yadav

In [28]:
filt = ((df['last'] == 'Yadav') & (df['first'] == 'Krishna'))

In [29]:
df.loc[~filt, 'email']

0    PrasitPoudel@gmail.com
1    RamKshetri@outlook.com
Name: email, dtype: object

In [30]:
# & = AND , | = OR

In [31]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [32]:
df

                    email    first     last
0  PrasitPoudel@gmail.com   Prasit   Poudel
1  RamKshetri@outlook.com      Ram  Kshetri
2  KrishnaYadav@yahoo.com  Krishna    Yadav

In [33]:
df.columns = ['email', 'first_name', 'last_name']

In [34]:
df

                    email first_name last_name
0  PrasitPoudel@gmail.com     Prasit    Poudel
1  RamKshetri@outlook.com        Ram   Kshetri
2  KrishnaYadav@yahoo.com    Krishna     Yadav

In [35]:
df.columns = [x.lower() for x in df.columns]

In [36]:
df

                    email first_name last_name
0  PrasitPoudel@gmail.com     Prasit    Poudel
1  RamKshetri@outlook.com        Ram   Kshetri
2  KrishnaYadav@yahoo.com    Krishna     Yadav

In [37]:
df.columns = df.columns.str.replace(' ', '_')
df

                    email first_name last_name
0  PrasitPoudel@gmail.com     Prasit    Poudel
1  RamKshetri@outlook.com        Ram   Kshetri
2  KrishnaYadav@yahoo.com    Krishna     Yadav

In [38]:
df.rename(columns={'first_name' : 'first', 'last_name': 'last'}, inplace=True)

In [39]:
df

                    email    first     last
0  PrasitPoudel@gmail.com   Prasit   Poudel
1  RamKshetri@outlook.com      Ram  Kshetri
2  KrishnaYadav@yahoo.com  Krishna    Yadav

In [40]:
df.loc[2] = ['HariKashyap@gmail.com', 'Hari', 'Kashyap']

In [41]:
df.loc[2, ['last', 'email']] = ['Yadav', 'HariYadav@hotmail.com']

In [42]:
df.at[2, 'last'] = 'Hara'

In [43]:
df

                    email   first     last
0  PrasitPoudel@gmail.com  Prasit   Poudel
1  RamKshetri@outlook.com     Ram  Kshetri
2   HariYadav@hotmail.com    Hari     Hara

In [44]:
df['email'] = df['email'].str.lower()
df

                    email   first     last
0  prasitpoudel@gmail.com  Prasit   Poudel
1  ramkshetri@outlook.com     Ram  Kshetri
2   hariyadav@hotmail.com    Hari     Hara

In [45]:
df['email'].apply(len)

0    22
1    22
2    21
Name: email, dtype: int64

In [46]:
def update_email(email):
    return email.upper()

In [47]:
df['email'] = df['email'].apply(update_email)
df

                    email   first     last
0  PRASITPOUDEL@GMAIL.COM  Prasit   Poudel
1  RAMKSHETRI@OUTLOOK.COM     Ram  Kshetri
2   HARIYADAV@HOTMAIL.COM    Hari     Hara

In [48]:
df['email'] = df['email'].apply(lambda x : x.lower())
df

                    email   first     last
0  prasitpoudel@gmail.com  Prasit   Poudel
1  ramkshetri@outlook.com     Ram  Kshetri
2   hariyadav@hotmail.com    Hari     Hara

In [49]:
df.apply(len, axis="columns")

0    3
1    3
2    3
dtype: int64

In [50]:
df.apply(pd.Series.min) # lambda x : x.min()

email    hariyadav@hotmail.com
first                     Hari
last                      Hara
dtype: object

In [51]:
df.applymap(len)

C:\Users\Prasit\AppData\Local\Temp\ipykernel_2248\1485728669.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   email  first  last
0     22      6     6
1     22      3     7
2     21      4     4

In [52]:
df.applymap(str.lower)

C:\Users\Prasit\AppData\Local\Temp\ipykernel_2248\357608748.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.lower)

                    email   first     last
0  prasitpoudel@gmail.com  prasit   poudel
1  ramkshetri@outlook.com     ram  kshetri
2   hariyadav@hotmail.com    hari     hara

In [53]:
df['first'].map({'Hari': 'Krishna', 'Ram': 'Shiva'})

0        NaN
1      Shiva
2    Krishna
Name: first, dtype: object

In [54]:
df['first'].replace({'Hari': 'Krishna', 'Ram': 'Shiva'})

0     Prasit
1      Shiva
2    Krishna
Name: first, dtype: object

In [55]:
df['first'] + ' ' + df['last']

0    Prasit Poudel
1      Ram Kshetri
2        Hari Hara
dtype: object

In [56]:
df['full_name'] = df['first'] + ' ' + df['last'] # Cammot be used with .
df

                    email   first     last      full_name
0  prasitpoudel@gmail.com  Prasit   Poudel  Prasit Poudel
1  ramkshetri@outlook.com     Ram  Kshetri    Ram Kshetri
2   hariyadav@hotmail.com    Hari     Hara      Hari Hara

In [57]:
df.drop(columns= ['first', 'last'], inplace=True)
df

                    email      full_name
0  prasitpoudel@gmail.com  Prasit Poudel
1  ramkshetri@outlook.com    Ram Kshetri
2   hariyadav@hotmail.com      Hari Hara

In [58]:
df['full_name'].str.split(' ', expand=True)

        0        1
0  Prasit   Poudel
1     Ram  Kshetri
2    Hari     Hara

In [59]:
df[['first','last']] = df['full_name'].str.split(' ', expand=True)
df

                    email      full_name   first     last
0  prasitpoudel@gmail.com  Prasit Poudel  Prasit   Poudel
1  ramkshetri@outlook.com    Ram Kshetri     Ram  Kshetri
2   hariyadav@hotmail.com      Hari Hara    Hari     Hara

In [60]:
# df.append({'first': 'Kishore'}) is deprecated
df.loc[df.shape[0]+1, 'first'] = 'Kishore'

In [61]:
df

                    email      full_name    first     last
0  prasitpoudel@gmail.com  Prasit Poudel   Prasit   Poudel
1  ramkshetri@outlook.com    Ram Kshetri      Ram  Kshetri
2   hariyadav@hotmail.com      Hari Hara     Hari     Hara
4                     NaN            NaN  Kishore      NaN

In [62]:
people = {
    "first" : ['Tony', 'Steve'],
    "last" : ['Stark', 'Rogers'],
    "email" : ['IronMan@avengers.com', 'Cap@avengers.com']
}
df2 = pd.DataFrame(people)

In [63]:
df = pd.concat([df,df2], ignore_index=True)

In [64]:
df

                    email      full_name    first     last
0  prasitpoudel@gmail.com  Prasit Poudel   Prasit   Poudel
1  ramkshetri@outlook.com    Ram Kshetri      Ram  Kshetri
2   hariyadav@hotmail.com      Hari Hara     Hari     Hara
3                     NaN            NaN  Kishore      NaN
4    IronMan@avengers.com            NaN     Tony    Stark
5        Cap@avengers.com            NaN    Steve   Rogers

In [65]:
df.drop(index=[3, 5])

                    email      full_name   first     last
0  prasitpoudel@gmail.com  Prasit Poudel  Prasit   Poudel
1  ramkshetri@outlook.com    Ram Kshetri     Ram  Kshetri
2   hariyadav@hotmail.com      Hari Hara    Hari     Hara
4    IronMan@avengers.com            NaN    Tony    Stark

In [66]:
filt = df['first'] == 'Kishore'
df = df.drop(index=df[filt].index)
df

                    email      full_name   first     last
0  prasitpoudel@gmail.com  Prasit Poudel  Prasit   Poudel
1  ramkshetri@outlook.com    Ram Kshetri     Ram  Kshetri
2   hariyadav@hotmail.com      Hari Hara    Hari     Hara
4    IronMan@avengers.com            NaN    Tony    Stark
5        Cap@avengers.com            NaN   Steve   Rogers

In [67]:
df = df.drop(index=[4,5])
df

                    email      full_name   first     last
0  prasitpoudel@gmail.com  Prasit Poudel  Prasit   Poudel
1  ramkshetri@outlook.com    Ram Kshetri     Ram  Kshetri
2   hariyadav@hotmail.com      Hari Hara    Hari     Hara

In [68]:
df.sort_values(by = 'last', ascending=False)

                    email      full_name   first     last
0  prasitpoudel@gmail.com  Prasit Poudel  Prasit   Poudel
1  ramkshetri@outlook.com    Ram Kshetri     Ram  Kshetri
2   hariyadav@hotmail.com      Hari Hara    Hari     Hara